import pandas as pd
import tushare as ts
import os
output = pd.DataFrame({
    'a': {'one': 4, 'two': 6, 'three': 6},
    'b': {'one': 1, 'two': 2, 'three': 1},
    'c': {'one': 1, 'two': 0, 'three': 6},
})

# df = pd.DataFrame({'股票代码': [1,2],
#                    'T涨停日期': [1,2],
#                    'T涨停时间段': [1,2],
#                    'T涨停价格': [1,2],
#                    'T1开盘价格': [1],
#                    'T2开盘价格': [1,2],
#                    'T2收盘价格': [1,2],
#                    'T2收益率（收-开）': [1,2],
#                    'T2收益率（开-开）': [1,2],
#                    'T3开盘价格': [1,2],
#                    'T3收盘价格': [1,2],
#                    'T3收益率（收-开）': [1,2],
#                    'T3收益率（开-开）': [1,2],
#                    'T4开盘价格': [1,2],
#                    'T4收盘价格': [1,2],
#                    'T4收益率（收-开）': [1,2],
#                    'T4收益率（开-开）': [1,2],
#                    'T5开盘价格': [1,2],
#                    'T5收盘价格': [1,2],
#                    'T5收益率（收-开）': [1,2],
#                    'T5收益率（开-开）': [1,2],
#                    'T6开盘价格': [1,2],
#                    'T6收盘价格': [1,2],
#                    'T6收益率（收-开）': [1,2],
#                    'T6收益率（开-开）': [1,2],
#                    })
# cols=['股票代码','T涨停日期', 'T涨停时间段', 'T涨停价格','T1开盘价格','T2开盘价格',
#       'T2收盘价格', 'T2收益率（收-开）', 'T2收益率（开-开）', 'T3开盘价格',
#       'T3收盘价格', 'T3收益率（收-开）', 'T3收益率（开-开）', 'T4开盘价格',
#       'T4收盘价格', 'T4收益率（收-开）', 'T4收益率（开-开）', 'T5开盘价格',
#       'T5收盘价格', 'T5收益率（收-开）', 'T5收益率（开-开）', 'T6开盘价格',
#       'T6收盘价格', 'T6收益率（收-开）', 'T6收益率（开-开）']
# df=df.ix[:, cols]
# aa = df['股票代码'].tolist()
# df.to_excel("/Users/chenjian/Desktop/aaa.xlsx", sheet_name="sheet2")



# result = pd.DataFrame()
# append = result.append(output)

print("T" + "1" + "ab")

#3:09

